(function(angular){
    'use strict';
    angular.module('shareModule').constant('cities', [{
        cityCode: '021',
        name: '上海市',
        districts: ['黄浦区', '徐汇区', '长宁区', '静安区',
            '普陀区', '虹口区', '杨浦区', '闵行区','宝山区',
            '嘉定区', '浦东新区', '金山区', '松江区', '青浦区',
            '奉贤区', '崇明县', '卢湾区（黄浦区）',   '闸北区（静安区）']
    }, {
        cityCode: '028',
        name: '成都市',
        districts: ['锦江区', '青羊区', '金牛区', '武侯区', '成华区', '龙泉驿区',
            '青白江区', '新都区', '温江区', '金堂县', '双流县', '郫县', '大邑县','蒲江县',
            '新津县', '都江堰市', '彭州市', '邛崃市', '崇州市', '高新区（武侯区）',
            '高新西区（郫县）']
    }, {
        cityCode: '0551',
        name: '合肥市',
        districts: ['瑶海区', '庐阳区', '蜀山区', '包河区', '长丰县', '肥东县',
            '肥西县', '巢湖市', '庐江县', '高新区（蜀山区）', '居巢区（巢湖市）']
    }, {
        cityCode: '020',
        name: '广州市',
        districts: ['荔湾区', '越秀区', '海珠区', '天河区', '白云区', '黄埔区', '番禹区',
            '花都区', '南沙区', '萝岗区', '增城区', '从化区' ]
    }, {
        cityCode: '0755',
        name: '深圳市',
        districts: ['罗湖区', '福田区', '南山区', '宝安区', '龙岗区', '盐田区', '坪山新区（龙岗区）',
            '大鹏新区（龙岗区）', '光明新区（宝安区）', '龙华新区（宝安区）']
    }, {
        cityCode: '025',
        name: '南京市',
        districts: ['玄武区', '秦淮区', '建邺区', '鼓楼区', '浦口区', '栖霞区', '雨花台区', '江宁区', 
            '六合区', '溧水区', '高淳区', '白下区 (秦淮区)', '下关区 (鼓楼区)']
    }, {
        cityCode: '0512',
        name: '苏州市',
        districts: ['虎丘区', '吴中区', '相城区', '姑苏区', '常熟市', '张家港市', '昆山市', '吴江区', '太仓市', 
            '工业园区 (姑苏区)', '高新区 (虎丘区)', '沧浪区 (姑苏区)', '平江区 (姑苏区)', '金阊区 (姑苏区)']
    }, {
        cityCode: '0571',
        name: '杭州市',
        districts: ['上城区', '下城区', '江干区', '拱墅区', '西湖区', '滨江区', '萧山区', '余杭区', '桐庐县', '淳安县', '建德市',
            '富阳区', '临安市']
    }, {
        cityCode: '0573',
        name: '嘉兴市',
        districts: ['南湖区', '秀洲区', '嘉善县', '海盐县', '海宁市', '平湖市', '桐乡市']
    }, {
        cityCode: '0796',
        name: '吉安市',
        districts: ['吉州区', '青原区', '吉安县', '吉水县', '峡江县', '新干县', '永丰县', '泰和县', '遂川县', '万安县', '安福县', '永新县', '井冈山市']
    }, {
        cityCode: '086',
        name: '其他城市',
        districts: ['其他']
    }]);
})(angular);
